# Задайте список из n чисел последовательности $(1+1/n)^n$
#  и выведите на экран их сумму.

# Пример:

# - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}

n = int(input('n = '))
dict1 = {}
s = 0
for i in range(1, n+1):
    dict1.update({i:(1+(1/i))**i})
    s = s + (1+(1/i))**i
print(dict1)

print(s)